Documents/_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>_Заявка</Name>
			<BasedOn>
				<xr:Item>Document._Заявка</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВОтчетСогласованныеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаУНас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначенаНа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef._СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техподдержка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДПисьма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВхИсх</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийHTML</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатьОписания</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Роли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановыеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьЧекЛисты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвтоНачисление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланОтветственный</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланСотрудник</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаписиRM</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотрено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаВВыходные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стадия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._СтадииРазработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef._СтатусыЧЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыКлиенту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПлановые</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗадание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеHTML</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/_Заявка/Ext/ManagerModule.bsl
Процедура ПеренестиВсеНевыставленныеЧасыИзЗадач(Объект) Экспорт 
    ВызватьИсключение("не актуальна");
    ТАблицаВыставленных = Объект.ЧекЛисты.Выгрузить(,"КодСтроки,Задача");
    ВыборкаДетальныеЗаписи  = Объект.ПолучитьНеперенесенныеЗадачи(ТАблицаВыставленных);
    
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        строкаЧл = Объект.чекЛисты.НайтиСтроки(Новый Структура("КодСтроки,Задача",ВыборкаДетальныеЗаписи.КодСтроки,ВыборкаДетальныеЗаписи.Задача)) ;
        Если ВыборкаДетальныеЗаписи.Удалить тогда
            Объект.ЧекЛисты.Удалить(строкаЧл[0]);
        иначе
            Если строкаЧл.Количество()  тогда
                строкаЧл = строкаЧл[0];    
            Иначе 
                строкаЧл                = Объект.чекЛисты.Добавить();
        КонецЕсли;
        
        строкаЧл.Ответственный  = ВыборкаДетальныеЗаписи.БизнесПроцесс.Автор;
        строкаЧл.Сотрудник      = ВыборкаДетальныеЗаписи.Задача.Исполнитель;
        строкаЧл.Часы           = ВыборкаДетальныеЗаписи.Часы;
        строкаЧл.ЧасыКлиенту    = ?(ВыборкаДетальныеЗаписи.НеВыставлятьКонтрагенту,0, ВыборкаДетальныеЗаписи.Часы);
        строкаЧл.Описание       = ВыборкаДетальныеЗаписи.Описание;
        строкаЧл.ЭтоЗадание     = Истина;
        строкаЧл.Важная         = ВыборкаДетальныеЗаписи.БизнесПроцесс.Срочная;
        строкаЧл.Дата           = ВыборкаДетальныеЗаписи.Дата;
        строкаЧл.Задание        = ВыборкаДетальныеЗаписи.БизнесПроцесс.Наименование + ?(ВыборкаДетальныеЗаписи.Задача.ОписаниеДоработки <> "" , Символы.ПС + ВыборкаДетальныеЗаписи.Задача.ОписаниеДоработки,"");
        //  строкаЧл.ЗаданиеHTML    = ВыборкаДетальныеЗаписи.БизнесПроцесс.ЗаданиеHTML;
        строкаЧл.Задача         = ВыборкаДетальныеЗаписи.Задача;
        строкаЧл.КодСтроки      = ВыборкаДетальныеЗаписи.КодСтроки;
        КонецЕсли;
    КонецЦикла;
    
    
    ВыборкаДетальныеЗаписи = Объект.ПолучитьНеперенесенныеРС(ТАблицаВыставленных);
    
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        Если ВыборкаДетальныеЗаписи.кодстроки = новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")  тогда
            Продолжить;
        КонецЕсли;
        строкаЧл = Объект.чекЛисты.НайтиСтроки(новый Структура("КодСтроки, Задача",ВыборкаДетальныеЗаписи.КодСтроки,Задачи._ИсполнениеЗадач.ПустаяСсылка())) ;
        
        Если ВыборкаДетальныеЗаписи.Удалить тогда
            Объект.ЧекЛисты.Удалить(строкаЧл[0]);
        иначе
            Если строкаЧл.Количество()  тогда
                строкаЧл = строкаЧл[0];    
            Иначе 
                строкаЧл                = Объект.чекЛисты.Добавить();
            КонецЕсли;
            
            ЗаполнитьЗначенияСвойств(строкаЧл,ВыборкаДетальныеЗаписи);
        КонецЕсли;  
    КонецЦикла;
    
    
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    
    Если не ЗначениеЗаполнено( Данные.ссылка ) тогда возврат КонецЕсли;
    СтандартнаяОбработка = Ложь; 
    Номер = Данные.ссылка.Номер;
    Попытка
        Номер = Число(Номер);
    Исключение;
    КонецПопытки;
    Представление =  ""+ Формат(Номер, "ЧДЦ=0; ЧГ=0") + " от " + Формат(Данные.ссылка.Дата,"ДФ=dd.MM.yy")+ " :   " + Данные.ссылка.Контрагент + " :  "+Данные.ссылка.Название 
    
КонецПроцедуры

Процедура ПечатьОписания(ТабДок, Ссылка) Экспорт
    
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печатть описания)
    Макет = Документы._Заявка.ПолучитьМакет("ПечатьОписания");
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Заявка.Автор,
    |	Заявка.Дата,
    |	Заявка.Коментарий,
    |	Заявка.КонтактноеЛицо,
    |	Заявка.Контрагент,
    |	Заявка.Название,
    |	Заявка.Номер,
    |	Заявка.Описание,
    |	Заявка.СогласованныеЧасы,
    |	Заявка.Статус,
    |	Заявка.Смета.(
    |		НомерСтроки,
    |		Сотрудник
    |	)
    |ИЗ
    |	Документ._Заявка КАК Заявка
    |ГДЕ
    |	Заявка.Ссылка В (&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьСметаШапка = Макет.ПолучитьОбласть("СметаШапка");
    ОбластьСмета = Макет.ПолучитьОбласть("Смета");
    Подвал = Макет.ПолучитьОбласть("Подвал");
    
    ТабДок.Очистить();
    
    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        ТабДок.Вывести(ОбластьЗаголовок);
        
        Шапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Шапка, Выборка.Уровень());
        
        
        Подвал.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Подвал);
        
        
        ТабДок.Вывести(ОбластьСметаШапка);
        
        ВыборкаСмета = Выборка.Смета.Выбрать();
        Пока ВыборкаСмета.Следующий() Цикл
            ОбластьСмета.Параметры.Заполнить(ВыборкаСмета);
            ТабДок.Вывести(ОбластьСмета, ВыборкаСмета.Уровень());
        КонецЦикла;
        
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    //}}
КонецПроцедуры


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    | Заявка.Ссылка КАК Ссылка
    |ИЗ
    | Документ._Заявка КАК Заявка
    |ГДЕ
    | (Заявка.Название ПОДОБНО &СтрокаПоиска
    |         ИЛИ Заявка.Номер ПОДОБНО &СтрокаПоиска)"  ;
    
    
    Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
    
    РезультатЗапроса = Запрос.Выполнить();
    Таблица = РезультатЗапроса.Выгрузить();
    Массив = Таблица.ВыгрузитьКолонку("Ссылка");
    
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(Массив);
    
КонецПроцедуры


Процедура Печать_ЛУВР_ЭЗОИС(ТабДок, Ссылка, Период) Экспорт
    ВызватьИсключение("не актуальна");
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать_ЛУВР_ЭЗОИС)
    Макет = Документы._Заявка.ПолучитьМакет("Печать_ЛУВР_ЭЗОИС");
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   ВЫБОР
    |       КОГДА Заявка.Техподдержка
    |           ТОГДА &Дата
    |       КОГДА Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
    |           ТОГДА Заявка.ДатаОкончания
    |       ИНАЧЕ Заявка.ДатаАкта
    |   КОНЕЦ КАК Дата,
    |   Заявка.Номер КАК Номер,
    |   Заявка.ЧекЛисты.(
    |       НомерСтроки КАК НомерСтроки,
    |       Дата КАК Дата,
    |       Часы КАК Часы,
    |       ВЫБОР
    |           КОГДА Заявка.ЧекЛисты.Задание = """"
    |               ТОГДА """"
    |           ИНАЧЕ Заявка.ЧекЛисты.Задание + "" - ""
    |       КОНЕЦ + Заявка.ЧекЛисты.Описание КАК Описание
    |   ) КАК ЧекЛисты
    |ИЗ
    |   Документ._Заявка КАК Заявка
    |ГДЕ
    |   Заявка.Ссылка = &Ссылка
    |   И ВЫБОР
    |           КОГДА Заявка.Техподдержка
    |               ТОГДА Заявка.ЧекЛисты.Дата МЕЖДУ &Дата И &Дата1
    |           ИНАЧЕ ИСТИНА
    |       КОНЕЦ
    |
    |УПОРЯДОЧИТЬ ПО
    |   НомерСтроки";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Запрос.Параметры.Вставить("Дата", Период.ДатаНачала);
    Запрос.Параметры.Вставить("Дата1", Период.ДатаОкончания);
    Выборка = Запрос.Выполнить().Выбрать();
    
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьЧекЛистыШапка = Макет.ПолучитьОбласть("ЧекЛистыШапка");
    ОбластьЧекЛисты = Макет.ПолучитьОбласть("ЧекЛисты");
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ТабДок.Очистить();
    
    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        Итого = 0;
        
        Шапка.Параметры.Заполнить(Выборка);
        Шапка.Параметры.Дата = НРег(Формат(Выборка.Дата, "ДФ='MMMM yyyy'"));
        
        ТабДок.Вывести(Шапка, Выборка.Уровень());
        ТабДок.Вывести(ОбластьЧекЛистыШапка);
        ВыборкаЧекЛисты = Выборка.ЧекЛисты.Выбрать();
        Пока ВыборкаЧекЛисты.Следующий() Цикл
            ОбластьЧекЛисты.Параметры.Заполнить(ВыборкаЧекЛисты);
            ОбластьЧекЛисты.Параметры.Дата  = НРег(Формат(ВыборкаЧекЛисты.Дата,"ДФ=dd.MM.yy"));
            Итого = Итого + ВыборкаЧекЛисты.Часы ;
            ТабДок.Вывести(ОбластьЧекЛисты, ВыборкаЧекЛисты.Уровень());
        КонецЦикла;
        ОбластьПодвал.Параметры.Итого = Итого;
        ТабДок.Вывести(ОбластьПодвал, Выборка.Уровень());
        
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    //}}
КонецПроцедуры
